#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/pathivadaorg/demo-github-actions/runs/run-Sr2BAKutwrhUNgcW

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=gorgeous-snail]
data.aws_ami.ubuntu: Reading...
data.aws_iam_policy_document.deny_region_interaction: Reading...
aws_security_group.web-sg: Refreshing state... [id=sg-0f14dcb891bd16455]
data.aws_iam_policy_document.require_mfa_ec2_actions: Reading...
data.aws_iam_policy_document.deny_region_interaction: Read complete after 0s [id=3057638609]
aws_organizations_policy.deny_region_interaction: Refreshing state... [id=p-jjbbovb4]
data.aws_iam_policy_document.require_mfa_ec2_actions: Read complete after 0s [id=3458749608]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-031cf125b681ca3e0]
aws_instance.web: Refreshing state... [id=i-002dddaffbd71c35c]
aws_organizations_policy_attachment.deny_region_interaction_attachment: Refreshing state... [id=ou-a6ih-akiwo6r2:p-jjbbovb4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_organizations_policy.require_mfa_ec2_actions will be created
  + resource "aws_organizations_policy" "require_mfa_ec2_actions" {
      + arn         = (known after apply)
      + content     = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2:TerminateInstances",
                          + "ec2:StopInstances",
                          + "ec2:SendDiagnosticInterrupt",
                        ]
                      + Condition = {
                          + BoolIfExists = {
                              + "aws:MultiFactorAuthPresent" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "*"
                      + Sid       = "RequireMFAEC2"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + description = "Require MFA Stopping or Deleting EC2 Instances"
      + id          = (known after apply)
      + name        = "Require MFA EC2 Actions"
      + type        = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy_attachment.require_mfa_ec2_actions_attachment will be created
  + resource "aws_organizations_policy_attachment" "require_mfa_ec2_actions_attachment" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-a6ih-akiwo6r2"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Sr2BAKutwrhUNgcW/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Sr2BAKutwrhUNgcW/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @murali12180, Action: `pull_request`*